
## Plan Result




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.case-disposer-action-group.azurerm_template_deployment.action-group
  * module.lau-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.caseDisposerAlertEmail will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "caseDisposerAlertEmail"  {
      + content_type   = (known after apply)
      ~ id             = "https://lau-aat.vault.azure.net/secrets/caseDisposerAlertEmail/e4d0dfc7f98d4c6589ef598d480b80fc" -> (known after apply)
        key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat"
        name           = "caseDisposerAlertEmail"
      ~ tags           = {
          - "file-encoding" = "utf-8"
        } -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = "e4d0dfc7f98d4c6589ef598d480b80fc" -> (known after apply)
      ~ versionless_id = "https://lau-aat.vault.azure.net/secrets/caseDisposerAlertEmail" -> (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.case-disposer-action-group.azurerm_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_template_deployment" "action-group" {
        deployment_mode     = "Incremental"
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.Resources/deployments/dispr-alert_aat"
        name                = "dispr-alert_aat"
        outputs             = {}
      ~ parameters          = {
          - "actionGroupName"      = "ccd-case-disposer-aat-ag"
          - "emailReceiverAddress" = "dave.jones@hmcts.net"
          - "emailReceiverName"    = "Case Disposer Deletion Failure Alert"
          - "location"             = "global"
          - "shortName"            = "dispr-alert"
        } -> (known after apply)
        resource_group_name = "ccd-shared-aat"
        template_body       = jsonencode(
            {
                $schema        = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
                contentVersion = "1.0.0.0"
                parameters     = {
                    actionGroupName      = {
                        type = "string"
                    }
                    emailReceiverAddress = {
                        metadata = {
                            description = "Email address of the receiver"
                        }
                        type     = "string"
                    }
                    emailReceiverName    = {
                        metadata = {
                            description = "Name of the email receiver"
                        }
                        type     = "string"
                    }
                    location             = {
                        defaultValue = "global"
                        type         = "string"
                    }
                    shortName            = {
                        type = "string"
                    }
                }
                resources      = [
                    {
                        apiVersion = "2017-04-01"
                        location   = "[parameters('location')]"
                        name       = "[parameters('actionGroupName')]"
                        properties = {
                            emailReceivers   = [
                                {
                                    emailAddress = "[parameters('emailReceiverAddress')]"
                                    name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                            enabled          = true
                            groupShortName   = "[parameters('shortName')]"
                            smsReceivers     = []
                            webhookReceivers = []
                        }
                        tags       = {}
                        type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        )
    }

  # module.lau-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat|lau-aat"
        log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        name                       = "lau-aat"
        target_resource_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat"

        log {
            category = "AuditEvent"
            enabled  = true

            retention_policy {
                days    = 14
                enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":27,"Program":"tfcmt","SHA1":"","Vars":{}} -->